export const settings = {
  auth: {
    accessTokenLocalStorageKey: "accessToken",
    refreshTokenLocalStorageKey: "refreshToken",
  },
  presets: {
    deliveryDescriptions: [
      "타임딜 마감 후 다음 날 택배를 발송하여 평균 2-3일 이내에 상품을 받아보실 수 있습니다.",
      "배송비는 각 상품 또는 유통사에 따라 다를 수 있으며, 주문/결제 페이지에서 정확한 금액을 확인하실 수 있습니다.",
    ],
    cancelDescriptions: [
      "주문 취소는 주문 상태가 배송 전일 때 가능합니다. 마이페이지의 주문 내역 확인하기에서 주문 취소를 요청해주세요.",
      "부분 취소의 경우, 마이페이지의 주문 내역 확인하기에서 1:1 문의를 통해 요청해주세요.",
      "교환 및 반품을 원하시는 경우 상품 수령 후 5일 이내에 주문 취소를 요청해야 합니다. 마이페이지의 주문 내역 확인하기에서 1:1 문의를 통해 요청해주시면 빠르게 도와드리겠습니다.",
      "팩토리 아울렛 타임딜의 경우, 팩토리 아울렛 매장에서는 불가능했던 교환/반품이 올오프에서는 가능합니다. 단, 배송비(왕복 5,000원) 외 교환/반품 수수료가 발생합니다. (최초 1회 무료 교환/반품 가능. 교환/반품 수수료는 결제 금액의 10%, 최대 20,000원)",
      "교환 및 반품 요청이 접수되면 영업일 기준 2-3일 내에 택배기사님이 연락 후 방문하여 회수가 진행됩니다.",
      "상품입고 후 1일의 검수 시간이 소요되며, 검수 완료 후 교환 및 반품 처리가 진행됩니다.",
      "상품 훼손 또는 외부 착용, 브랜드 택/박스 분실 및 훼손, 수령 후 5일이 지난 경우 교환 및 반품이 불가합니다.",
      "단순 변심에 의한 배송비(왕복 5,000원)는 고객부담입니다.",
      "B품/샘플 상품의 경우 스크래치/진열/미세 오염 등의 사유로 저렴하게 판매하는 상품입니다. 올오프 MD가 꼼꼼하게 검수하여 해당 부분에 대해서 [B품/샘플 상세정보]에 자세한 사진과 설명을 첨부해놓았습니다. 상품 상세정보를 확인하시어, 신중한 구매 부탁드립니다.",
      "구매 전 상품에 대한 추가 확인이 필요하신 경우, 하단의 [문의하기]를 통해 문의주시면 빠르게 도와드리겠습니다.",
    ],
    timedealInstructions: [
      "타임딜 상품은 올오프 MD가 팩토리 아울렛 및 현대/롯데/신세계 프리미엄 아울렛에서 직소싱한 상품입니다.",
      "타임딜 상품은 아울렛의 정책에 따라 타임딜 마감 전까지 주문 취소만 가능합니다. 타임딜 마감 후 주문 취소/교환/반품이 어려운 점 참고하여 구매 부탁드립니다.",
    ],
    bProductInstrction: {
      title: "1년차 B품/샘플 유의사항",
      description: [
        "본 상품은 스크래치/진열/미세 오염 등의 사유로 저렴하게 판매하는 1년차 아울렛 상품입니다.",
        "아래 [B품/샘플 상세정보]를 통해 자세한 사진과 설명을 꼭 확인해주세요.",
      ],
    },
    outletInstrcution: {
      title: "아울렛 특가 유의사항",
      description: [
        "본 상품은 팩토리 아울렛 및 현대/롯데/신세계 프리미엄 아울렛에서 판매하는 아울렛 특가 상품입니다.",
        "아울렛 특가 상품은 보관 및 매장 진열 과정에서 포장 부자재, 택 누락이 있을 수 있습니다. 아래 상품설명을 꼭 확인해주세요.",
      ],
    },
  },
};
